
* Script.py

#+begin_src python :results output
  import numpy as np
  import pandas as pd
  import matplotlib.pyplot as plt
  import seaborn as sns

  df = pd.read_csv('wine_quality.csv')
  print(df.columns)
  y = df['quality']
  features = df.drop(columns = ['quality'])

  ## 1. Data transformation
  from sklearn.preprocessing import StandardScaler

  standard_scaler_fit = StandardScaler().fit(features)
  X = standard_scaler_fit.transform(features)

  ## 2. Train-test split
  from sklearn.model_selection import train_test_split

  X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=99)

  # 3. Fit a logistic regression classifier without regulatization
  from sklearn.linear_model import LogisticRegression

  #Remember to set the penalty to 'none'!
  clf_no_reg = LogisticRegression(penalty = None)
  clf_no_reg.fit(X_train, y_train)

  ## 4. Plot the coefficients
  predictors = features.columns
  coefficients = clf_no_reg.coef_.ravel()
  coef = pd.Series(coefficients, predictors).sort_values()
  coef.plot(kind='bar', title='Coefficients (no regularization)')
  plt.tight_layout()
  plt.show()
  plt.clf()

  ## 5. Training and test performance
  from sklearn.metrics import f1_score

  y_pred_test = clf_no_reg.predict(X_test)
  y_pred_train = clf_no_reg.predict(X_train)

  print('Training Score', f1_score(y_train, y_pred_train))
  print('Testing Score', f1_score(y_test, y_pred_test))

  ## 6. Default implementation (L2-regularized)
  clf_default = LogisticRegression()
  clf_default.fit(X_train, y_train)

  ## 7. Ridge Scores
  y_pred_train_ridge = clf_default.predict(X_train)
  y_pred_test_ridge = clf_default.predict(X_test)

  print('Ridge-regularized Training Score', f1_score(y_train, y_pred_train_ridge))

  print('Ridge-regularized Testing Score', f1_score(y_test, y_pred_test_ridge))

  ## 8. Coarse-grained hyperparameter tuning
  training_array = []
  test_array = []
  C_array = [0.0001, 0.001, 0.01, 0.1, 1]

  for x in C_array:
      clf = LogisticRegression(C = x)
      clf.fit(X_train, y_train)
      y_pred_test = clf.predict(X_test)
      y_pred_train = clf.predict(X_train)
      training_array.append(f1_score(y_train, y_pred_train))
      test_array.append(f1_score(y_test, y_pred_test))

  ## 9. Plot training and test scores as a function of C
  plt.plot(C_array,training_array, label='Training Score')
  plt.plot(C_array, test_array, label='Test Score')
  plt.xscale('log')
  plt.xlabel('C')
  plt.legend()
  plt.show()
  plt.clf()

#+end_src

#+RESULTS:
: Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
:        'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
:        'pH', 'sulphates', 'alcohol', 'quality'],
:       dtype='object')
: Training Score 0.7727598566308242
: Testing Score 0.7266666666666667
: Ridge-regularized Training Score 0.7727598566308242
: Ridge-regularized Testing Score 0.7266666666666667
